<?php
// +----------------------------------------------------------------------
// 自定义扩展配置
// +----------------------------------------------------------------------

return [
	//kindeditor上传文件允许的大小 //最大文件大小2M
	'file_size' => 2*1024*1024,
	//kindeditor上传文件允许的扩展名
	'ext_arr' => [
		'image' => ['gif', 'jpg', 'jpeg', 'png', 'bmp'],
		'file' => ['zip', 'rar', '7z', 'gz', 'bz2'],
	],
	
    // 会员类别（1、普通会员，2、设计师，3、设计团队，4、联盟成员会馆）
    'membercate' => [ '1' => '普通会员', '2' => '设计师', '3' => '设计团队', '4' => '联盟成员馆', ],
    //是否审核
    'is_chk' => [ '1' => '未审核', '2' => '<font color="green">已审核</font>', '3' => '<font color="red">未通过</font>',],

];
