<?php
// +----------------------------------------------------------------------
// 自定义扩展配置
// +----------------------------------------------------------------------

return [
	//kindeditor上传文件允许的大小 //最大文件大小2M
	'file_size' => 2*1024*1024,
	//kindeditor上传文件允许的扩展名
	'ext_arr' => [
		'image' => ['gif', 'jpg', 'jpeg', 'png', 'bmp'],
		'file' => ['zip', 'rar', '7z', 'gz', 'bz2'],
	],
	
    //会员类别（1、普通会员，2、设计师，3、设计团队，4、联盟成员会馆）
    'membercate' => [ '1' => '普通会员', '2' => '设计师', '3' => '设计团队', '4' => '联盟成员馆', ],
    //是否审核
    'is_chk' => [
    	'1' => '未审核', '2' => '<font color="green">已审核</font>', '3' => '<font color="red">未通过</font>',
	],
	
	//收藏分类
    'membercoll' => [ '1'=>'会员','2'=>'素材','3'=>'众包','4'=>'众筹','5'=>'商品', ],
	//众包项目状态
	'cs_status' => [
		'1'=>'已发布','2'=>'已审核','3'=>'已投稿','4'=>'已选稿','5'=>'已签约','6'=>'创作中','7'=>'已上传',
	],
	//众包项目投稿状态
	'wtb_status' => [ '1'=>'已投标','2'=>'已备选','3'=>'已中标','4'=>'已淘汰', ],
	//众筹项目状态
	'cf_status' => [ '1'=>'筹集中','2'=>'成功','3'=>'失败', ],
	//众筹订单状态
	'cforder_status' => [ '1'=>'已下单','2'=>'<font color="#f60">申请退订</font>','3'=>'已取消', ],
	//商品订单状态
	'sporder_status' => [
		'1'=>'待确认','2'=>'已确认','3'=>'已取消','4'=>'已发货','5'=>'已收货','6'=>'已完成','7'=>'已评论','8'=>'已关闭',
	],
	//广告位
	'adspos' => [
		'indexbanner'=>'首页banner广告位',
		'materialbanner'=>'素材banner广告位',
		'cdsourcbanner'=>'众包banner广告位',
		'cdfundbanner'=>'众筹banner广告位',
		'goodsbanner'=>'商品banner广告位',
		'articleright'=>'新闻列表右侧广告位',
		'm_index'=>'会员中心首页广告位',
	],
	//单页类型
	'help_cate' => [
		'helplist'=>'帮助中心',
		'about'=>'关于我们',
		'newguide'=>'新手指引',
		'safety'=>'安全保障',
		'kefu'=>'在线客服',
		'question'=>'调查问卷',
		'copyright'=>'版权申明',
		'xieyi'=>'服务协议',
	],
	//物流公司
	'logistics_gs' => [
		'1'=>'顺丰速运','2'=>'圆通速递','3'=>'申通快递','4'=>'中通快递','5'=>'百世快递','6'=>'韵达快递',
		'7'=>'天天快递','8'=>'中国邮政','9'=>'邮政特快专递','10'=>'宅急送','11'=>'德邦快递','12'=>'全峰快递',
	],

	//赠送积分方式
	/**
	 * 1. 充值积分和现金的兑换关系为1:1；
	 * 2. 用户首次注册奖励50积分；
	 * 3. 注册后第一次登陆奖励5积分；
	 * 4. 每日首次登陆奖励2积分；
	 * 5. 素材上传成功奖励2积分；
	 * 6. 会员提交众包设计方案奖励10积分；
	 * 7. 设计师发布自己的作品奖励5积分；
	 * 8. 成员馆发布动态或新闻奖励1积分。
	 */
	'income_arr' => [
		'1'=>['name'=>'充值','onoff'=>false,'jifen'=>0,'desc'=>'充值积分',],
		'2'=>['name'=>'登录','onoff'=>true,'jifen'=>2,'desc'=>'每日首次登陆',],
		'3'=>['name'=>'素材','onoff'=>true,'jifen'=>2,'desc'=>'素材上传成功',],
		'4'=>['name'=>'众包','onoff'=>true,'jifen'=>10,'desc'=>'提交众包设计方案',],
		'5'=>['name'=>'作品','onoff'=>true,'jifen'=>5,'desc'=>'设计师发布作品',],
		'6'=>['name'=>'动态新闻','onoff'=>true,'jifen'=>1,'desc'=>'成员馆发布动态',],
		'7'=>['name'=>'首次注册','onoff'=>true,'jifen'=>50,'desc'=>'首次注册',],
		'8'=>['name'=>'首次登陆','onoff'=>true,'jifen'=>5,'desc'=>'首次登陆',],
	],
	
];
